БухЭксп/InformationRegisters/CW_СостояниеСогласованияОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СостояниеСогласованияОбъекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СостояниеСогласованияОбъекта/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьСостояниеОбъекта(ОбъектСогласования, Состояние) Экспорт
	
	Запись = РегистрыСведений.CW_СостояниеСогласованияОбъекта.СоздатьМенеджерЗаписи();
	Запись.ОбъектСогласования = ОбъектСогласования;
	Запись.Прочитать();
	
	Запись.ОбъектСогласования = ОбъектСогласования;
	Запись.Состояние = Состояние;
	Запись.Записать();

КонецПроцедуры

Функция ПолучитьСостояниеОбъекта(ОбъектСогласования) Экспорт

	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СостояниеСогласованияОбъекта.ОбъектСогласования КАК ОбъектСогласования,
	               |	CW_СостояниеСогласованияОбъекта.Состояние КАК Состояние
	               |ИЗ
	               |	РегистрСведений.CW_СостояниеСогласованияОбъекта КАК CW_СостояниеСогласованияОбъекта
	               |ГДЕ
	               |	CW_СостояниеСогласованияОбъекта.ОбъектСогласования = &ОбъектСогласования";
	
	Запрос.УстановитьПараметр("ОбъектСогласования",ОбъектСогласования);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Состояние;
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции

#КонецЕсли
